# Pandas Tutorial

In [1]:
import pandas as pd
import numpy as np

## Series

In [2]:
labels = ['a','b','c']
arr = np.array([10,20,30])
arr2 = np.array([30,50,70])
d = {'a':10,'b':20,'c':30}

In [3]:
seri1 = pd.Series(data=arr2)
seri1

0    30
1    50
2    70
dtype: int32

In [4]:
seri2 = pd.Series(data=arr,index=labels)
seri2

a    10
b    20
c    30
dtype: int32

In [5]:
seri2_1 = pd.Series(data=d)
seri2_1

a    10
b    20
c    30
dtype: int64

In [6]:
seri2["a"] = 40
seri2

a    40
b    20
c    30
dtype: int32

In [7]:
seri1 + seri2

0   NaN
1   NaN
2   NaN
a   NaN
b   NaN
c   NaN
dtype: float64

In [8]:
seri1.index = labels
seri1+seri2

a     70
b     70
c    100
dtype: int32

## DataFrame

In [9]:
dic = {"Fruits":["Apple","Pear","Mandarin"],"Vegetables":["Leek","Broccoli","Purslane"]}
df = pd.DataFrame(dic)
df

     Fruits Vegetables
0     Apple       Leek
1      Pear   Broccoli
2  Mandarin   Purslane

In [10]:
df.index = ["A","B","C"]
df

     Fruits Vegetables
A     Apple       Leek
B      Pear   Broccoli
C  Mandarin   Purslane

In [11]:
df.columns = ["Fruit","Vegetable"]
df

      Fruit Vegetable
A     Apple      Leek
B      Pear  Broccoli
C  Mandarin  Purslane

In [12]:
np.random.seed(101) #When executing several times, numpy array does not change.
df = pd.DataFrame(np.random.randn(9,9),index='A B C D E F G H I'.split(),columns='W X Y Z O P Q R S'.split())

In [13]:
df.head(7)

,W,X,Y,Z,O,P,Q,R,S
A,2.706850,0.628133,0.907969,0.503826,0.651118,-0.319318,-0.848077,0.605965,-2.018168
B,0.740122,0.528813,-0.589001,0.188695,-0.758872,-0.933237,0.955057,0.190794,1.978757
C,2.605967,0.683509,0.302665,1.693723,-1.706086,-1.159119,-0.134841,0.390528,0.166905
D,0.184502,0.807706,0.072960,0.638787,0.329646,-0.497104,-0.754070,-0.943406,0.484752
E,-0.116773,1.901755,0.238127,1.996652,-0.993263,0.196800,-1.136645,0.000366,1.025984
F,-0.156598,-0.031579,0.649826,2.154846,-0.610259,-0.755325,-0.346419,0.147027,-0.479448
G,0.558769,1.024810,-0.925874,1.862864,-1.133817,0.610478,0.386030,2.084019,-0.376519

In [14]:
df.columns.tolist()

['W', 'X', 'Y', 'Z', 'O', 'P', 'Q', 'R', 'S']

In [15]:
df = df.reset_index(drop=True) #reset_index : reseting index from 0 to n
df

,W,X,Y,Z,O,P,Q,R,S
0,2.706850,0.628133,0.907969,0.503826,0.651118,-0.319318,-0.848077,0.605965,-2.018168
1,0.740122,0.528813,-0.589001,0.188695,-0.758872,-0.933237,0.955057,0.190794,1.978757
2,2.605967,0.683509,0.302665,1.693723,-1.706086,-1.159119,-0.134841,0.390528,0.166905
3,0.184502,0.807706,0.072960,0.638787,0.329646,-0.497104,-0.754070,-0.943406,0.484752
4,-0.116773,1.901755,0.238127,1.996652,-0.993263,0.196800,-1.136645,0.000366,1.025984
5,-0.156598,-0.031579,0.649826,2.154846,-0.610259,-0.755325,-0.346419,0.147027,-0.479448
6,0.558769,1.024810,-0.925874,1.862864,-1.133817,0.610478,0.386030,2.084019,-0.376519
7,0.230336,0.681209,1.035125,-0.031160,1.939932,-1.005187,-0.741790,0.187125,-0.732845
8,-1.382920,1.482495,0.961458,-2.141212,0.992573,1.192241,-1.046780,1.292765,-1.467514

In [16]:
df[["X","Y"]].head(3)

          X         Y
0  0.628133  0.907969
1  0.528813 -0.589001
2  0.683509  0.302665

In [17]:
df.W #series type

0    2.706850
1    0.740122
2    2.605967
3    0.184502
4   -0.116773
5   -0.156598
6    0.558769
7    0.230336
8   -1.382920
Name: W, dtype: float64

In [18]:
type(df[['W']])

pandas.core.frame.DataFrame

In [19]:
df["C"] = [i for i in range(0,9)] #form new column

In [20]:
df.head()

,W,X,Y,Z,O,P,Q,R,S,C
0,2.706850,0.628133,0.907969,0.503826,0.651118,-0.319318,-0.848077,0.605965,-2.018168,0
1,0.740122,0.528813,-0.589001,0.188695,-0.758872,-0.933237,0.955057,0.190794,1.978757,1
2,2.605967,0.683509,0.302665,1.693723,-1.706086,-1.159119,-0.134841,0.390528,0.166905,2
3,0.184502,0.807706,0.072960,0.638787,0.329646,-0.497104,-0.754070,-0.943406,0.484752,3
4,-0.116773,1.901755,0.238127,1.996652,-0.993263,0.196800,-1.136645,0.000366,1.025984,4

In [21]:
df.iloc[2] #2.indexteki tüm değerleri series olarak çağırır

W    2.605967
X    0.683509
Y    0.302665
Z    1.693723
O   -1.706086
P   -1.159119
Q   -0.134841
R    0.390528
S    0.166905
C    2.000000
Name: 2, dtype: float64

In [22]:
df.iloc[[2]] #2.indexteki tüm değerleri df olarak çağırır

,W,X,Y,Z,O,P,Q,R,S,C
2,2.605967,0.683509,0.302665,1.693723,-1.706086,-1.159119,-0.134841,0.390528,0.166905,2

In [23]:
df.loc[2,"Y"]

0.3026654485851825

In [24]:
df.loc[[2,3],['W','Y']]

          W         Y
2  2.605967  0.302665
3  0.184502  0.072960

In [25]:
df.loc[:,["O","P"]]

          O         P
0  0.651118 -0.319318
1 -0.758872 -0.933237
2 -1.706086 -1.159119
3  0.329646 -0.497104
4 -0.993263  0.196800
5 -0.610259 -0.755325
6 -1.133817  0.610478
7  1.939932 -1.005187
8  0.992573  1.192241

In [26]:
df.iloc[:,3:7]

          Z         O         P         Q
0  0.503826  0.651118 -0.319318 -0.848077
1  0.188695 -0.758872 -0.933237  0.955057
2  1.693723 -1.706086 -1.159119 -0.134841
3  0.638787  0.329646 -0.497104 -0.754070
4  1.996652 -0.993263  0.196800 -1.136645
5  2.154846 -0.610259 -0.755325 -0.346419
6  1.862864 -1.133817  0.610478  0.386030
7 -0.031160  1.939932 -1.005187 -0.741790
8 -2.141212  0.992573  1.192241 -1.046780

In [27]:
df < 0

       W      X      Y      Z      O      P      Q      R      S      C
0  False  False  False  False  False   True   True  False   True  False
1  False  False   True  False   True   True  False  False  False  False
2  False  False  False  False   True   True   True  False  False  False
3  False  False  False  False  False   True   True   True  False  False
4   True  False  False  False   True  False   True  False  False  False
5   True   True  False  False   True   True   True  False   True  False
6  False  False   True  False   True  False  False  False   True  False
7  False  False  False   True  False   True   True  False   True  False
8   True  False  False   True  False  False   True  False   True  False

In [28]:
df[df["Y"] < 0] #Y column gives values of less than 0

,W,X,Y,Z,O,P,Q,R,S,C
1,0.740122,0.528813,-0.589001,0.188695,-0.758872,-0.933237,0.955057,0.190794,1.978757,1
6,0.558769,1.024810,-0.925874,1.862864,-1.133817,0.610478,0.386030,2.084019,-0.376519,6

In [29]:
df[(df['W']>0) | (df['Y'] > 1)] #for and --> &, for or --> |

,W,X,Y,Z,O,P,Q,R,S,C
0,2.706850,0.628133,0.907969,0.503826,0.651118,-0.319318,-0.848077,0.605965,-2.018168,0
1,0.740122,0.528813,-0.589001,0.188695,-0.758872,-0.933237,0.955057,0.190794,1.978757,1
2,2.605967,0.683509,0.302665,1.693723,-1.706086,-1.159119,-0.134841,0.390528,0.166905,2
3,0.184502,0.807706,0.072960,0.638787,0.329646,-0.497104,-0.754070,-0.943406,0.484752,3
6,0.558769,1.024810,-0.925874,1.862864,-1.133817,0.610478,0.386030,2.084019,-0.376519,6
7,0.230336,0.681209,1.035125,-0.031160,1.939932,-1.005187,-0.741790,0.187125,-0.732845,7

In [30]:
df.iloc[:,2:4].columns#.tolist()

Index(['Y', 'Z'], dtype='object')

## Missing Data For DataFrame

In [31]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

In [32]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [33]:
df.dropna(axis=0) #Delete null values on any row.

     A    B  C
0  1.0  5.0  1

In [34]:
df.fillna(3) # Fill null values with 3

     A    B  C
0  1.0  5.0  1
1  2.0  3.0  2
2  3.0  3.0  3

In [35]:
df.dropna(axis=1) #Delete null values on any column.

   C
0  1
1  2
2  3

In [36]:
df.dropna(thresh=2) # Delete 2 null values row (at least)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [37]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

## GroupBy Method For DataFrame

In [38]:
data = pd.read_csv("diabetes.csv")

In [39]:
data.head(5)

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
0,6,148,72,35,0,33.6,0.627,50,1
1,1,85,66,29,0,26.6,0.351,31,0
2,8,183,64,0,0,23.3,0.672,32,1
3,1,89,66,23,94,28.1,0.167,21,0
4,0,137,40,35,168,43.1,2.288,33,1

In [40]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 768 entries, 0 to 767
Data columns (total 9 columns):
Pregnancies                 768 non-null int64
Glucose                     768 non-null int64
BloodPressure               768 non-null int64
SkinThickness               768 non-null int64
Insulin                     768 non-null int64
BMI                         768 non-null float64
DiabetesPedigreeFunction    768 non-null float64
Age                         768 non-null int64
Outcome                     768 non-null int64
dtypes: float64(2), int64(7)
memory usage: 54.1 KB

In [41]:
data.shape #768 satır 9 sütunluk bir data

(768, 9)

In [42]:
data.describe().T

,count,mean,std,min,25%,50%,75%,max
Pregnancies,768.0,3.845052,3.369578,0.000,1.00000,3.0000,6.00000,17.00
Glucose,768.0,120.894531,31.972618,0.000,99.00000,117.0000,140.25000,199.00
BloodPressure,768.0,69.105469,19.355807,0.000,62.00000,72.0000,80.00000,122.00
SkinThickness,768.0,20.536458,15.952218,0.000,0.00000,23.0000,32.00000,99.00
Insulin,768.0,79.799479,115.244002,0.000,0.00000,30.5000,127.25000,846.00
BMI,768.0,31.992578,7.884160,0.000,27.30000,32.0000,36.60000,67.10
DiabetesPedigreeFunction,768.0,0.471876,0.331329,0.078,0.24375,0.3725,0.62625,2.42
Age,768.0,33.240885,11.760232,21.000,24.00000,29.0000,41.00000,81.00
Outcome,768.0,0.348958,0.476951,0.000,0.00000,0.0000,1.00000,1.00

In [43]:
age = data.groupby("Age")

In [44]:
age

In [45]:
age.count().head()

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Outcome
Age,,,,,,,,
21,63,63,63,63,63,63,63,63
22,72,72,72,72,72,72,72,72
23,38,38,38,38,38,38,38,38
24,46,46,46,46,46,46,46,46
25,48,48,48,48,48,48,48,48

In [46]:
data["Age"].min()

21

In [47]:
data["Age"].mean()

33.240885416666664

In [48]:
data[data["Age"]==33]["Glucose"].max()

173

In [49]:
glucose = data.groupby("Age")["Glucose"].max().reset_index()

In [50]:
glucose.head()

   Age  Glucose
0   21      177
1   22      199
2   23      179
3   24      193
4   25      193

In [51]:
glucose.tail() #Last 5 rows

    Age  Glucose
47   68       91
48   69      136
49   70      145
50   72      119
51   81      134

In [52]:
glucose["Age"][3] #Third index's age value

24

In [53]:
glucose = glucose[:35]

In [54]:
glucose.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35 entries, 0 to 34
Data columns (total 2 columns):
Age        35 non-null int64
Glucose    35 non-null int64
dtypes: int64(2)
memory usage: 640.0 bytes

## Merging,Concatenating,Joining

In [55]:
df1 = pd.DataFrame({'A': np.array([0,1,2,3]),
                        'B': np.arange(4,8) ,
                        'C': np.arange(8,12),
                        'D': np.arange(12,16)},
                        index=[0, 1, 2, 3])

In [56]:
df2 = pd.DataFrame({'A': np.arange(16,20) ,
                        'B': np.arange(20,24),
                        'C': np.arange(24,28),
                        'D': np.arange(28,32)},
                         index=[4, 5, 6, 7])

In [57]:
df3 = pd.DataFrame({'A': np.arange(32,36),
                        'B': np.arange(36,40),
                        'C': np.arange(40,44),
                        'D': np.arange(44,48)},
                        index=[8, 9, 10, 11])

In [58]:
df1

   A  B   C   D
0  0  4   8  12
1  1  5   9  13
2  2  6  10  14
3  3  7  11  15

In [59]:
df2

    A   B   C   D
4  16  20  24  28
5  17  21  25  29
6  18  22  26  30
7  19  23  27  31

In [60]:
df3

     A   B   C   D
8   32  36  40  44
9   33  37  41  45
10  34  38  42  46
11  35  39  43  47

In [61]:
pd.concat([df1,df2,df3]) #Concatenation

     A   B   C   D
0    0   4   8  12
1    1   5   9  13
2    2   6  10  14
3    3   7  11  15
4   16  20  24  28
5   17  21  25  29
6   18  22  26  30
7   19  23  27  31
8   32  36  40  44
9   33  37  41  45
10  34  38  42  46
11  35  39  43  47

In [62]:
pd.concat([df1,df2,df3],axis=1)

      A    B     C     D     A     B     C     D     A     B     C     D
0   0.0  4.0   8.0  12.0   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN
1   1.0  5.0   9.0  13.0   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN
2   2.0  6.0  10.0  14.0   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN
3   3.0  7.0  11.0  15.0   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN
4   NaN  NaN   NaN   NaN  16.0  20.0  24.0  28.0   NaN   NaN   NaN   NaN
5   NaN  NaN   NaN   NaN  17.0  21.0  25.0  29.0   NaN   NaN   NaN   NaN
6   NaN  NaN   NaN   NaN  18.0  22.0  26.0  30.0   NaN   NaN   NaN   NaN
7   NaN  NaN   NaN   NaN  19.0  23.0  27.0  31.0   NaN   NaN   NaN   NaN
8   NaN  NaN   NaN   NaN   NaN   NaN   NaN   NaN  32.0  36.0  40.0  44.0
9   NaN  NaN   NaN   NaN   NaN   NaN   NaN   NaN  33.0  37.0  41.0  45.0
10  NaN  NaN   NaN   NaN   NaN   NaN   NaN   NaN  34.0  38.0  42.0  46.0
11  NaN  NaN   NaN   NaN   NaN   NaN   NaN   NaN  35.0  39.0  43.0  47.0

In [63]:
left = pd.DataFrame({'common': [1,2,3,4],
                     'A': [5,6,7,8],
                     'B': [9,10,11,12]})
   
right = pd.DataFrame({'common': [1,2,3,4],
                          'C': [13,14,15,16],
                          'D': [17,18,19,20]})

In [64]:
left

   common  A   B
0       1  5   9
1       2  6  10
2       3  7  11
3       4  8  12

In [65]:
right

   common   C   D
0       1  13  17
1       2  14  18
2       3  15  19
3       4  16  20

In [66]:
pd.merge(left,right,on="common")

   common  A   B   C   D
0       1  5   9  13  17
1       2  6  10  14  18
2       3  7  11  15  19
3       4  8  12  16  20

In [67]:
left = pd.DataFrame({'com1': [1,2,3,4],
                     'com2': [1,2,1,2],
                     'A': [5,6,7,8],
                     'B': [9,10,11,12]})
    
right = pd.DataFrame({'com1': [1,2,2,3],
                      'com2': [1,1,1,1],
                      'C': [13,14,15,16],
                      'D': [17,18,19,20]})

In [68]:
left

   com1  com2  A   B
0     1     1  5   9
1     2     2  6  10
2     3     1  7  11
3     4     2  8  12

In [69]:
right

   com1  com2   C   D
0     1     1  13  17
1     2     1  14  18
2     2     1  15  19
3     3     1  16  20

In [70]:
pd.merge(left, right, on=['com1', 'com2'])

   com1  com2  A   B   C   D
0     1     1  5   9  13  17
1     3     1  7  11  16  20

In [71]:
a = pd.merge(left, right, how='outer', on=['com1', 'com2'])

In [72]:
a

   com1  com2    A     B     C     D
0     1     1  5.0   9.0  13.0  17.0
1     2     2  6.0  10.0   NaN   NaN
2     3     1  7.0  11.0  16.0  20.0
3     4     2  8.0  12.0   NaN   NaN
4     2     1  NaN   NaN  14.0  18.0
5     2     1  NaN   NaN  15.0  19.0

In [73]:
a.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6 entries, 0 to 5
Data columns (total 6 columns):
com1    6 non-null int64
com2    6 non-null int64
A       4 non-null float64
B       4 non-null float64
C       4 non-null float64
D       4 non-null float64
dtypes: float64(4), int64(2)
memory usage: 336.0 bytes

In [74]:
left

   com1  com2  A   B
0     1     1  5   9
1     2     2  6  10
2     3     1  7  11
3     4     2  8  12

In [75]:
right

   com1  com2   C   D
0     1     1  13  17
1     2     1  14  18
2     2     1  15  19
3     3     1  16  20

In [76]:
pd.merge(left, right, how='right', on=['com1', 'com2'])

   com1  com2    A     B   C   D
0     1     1  5.0   9.0  13  17
1     3     1  7.0  11.0  16  20
2     2     1  NaN   NaN  14  18
3     2     1  NaN   NaN  15  19

In [77]:
pd.merge(left, right, how='left', on=['com1', 'com2'])

   com1  com2  A   B     C     D
0     1     1  5   9  13.0  17.0
1     2     2  6  10   NaN   NaN
2     3     1  7  11  16.0  20.0
3     4     2  8  12   NaN   NaN

## Operations

In [78]:
d = {"Name":["Ali",np.NaN,"Fatma",np.NaN,"Veli","Veli",np.NaN],"Age":[12,34,56,np.NaN,45,78,67],"School":["YTU","ITU","Marmara","İstanbul",np.NaN,np.NaN,"YTU"]}

In [79]:
data = pd.DataFrame(d)

In [80]:
data

    Name   Age    School
0    Ali  12.0       YTU
1    NaN  34.0       ITU
2  Fatma  56.0   Marmara
3    NaN   NaN  İstanbul
4   Veli  45.0       NaN
5   Veli  78.0       NaN
6    NaN  67.0       YTU

In [81]:
data.Name.unique()

array(['Ali', nan, 'Fatma', 'Veli'], dtype=object)

In [82]:
data.Name.unique().tolist()

['Ali', nan, 'Fatma', 'Veli']

In [83]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
Name      4 non-null object
Age       6 non-null float64
School    5 non-null object
dtypes: float64(1), object(2)
memory usage: 248.0+ bytes

In [84]:
data.Age.nunique()

6

In [85]:
data.Name.value_counts()

Veli     2
Fatma    1
Ali      1
Name: Name, dtype: int64

In [86]:
def times2(x):
    return x*2

In [87]:
data.Age.apply(times2)

0     24.0
1     68.0
2    112.0
3      NaN
4     90.0
5    156.0
6    134.0
Name: Age, dtype: float64

In [88]:
data.Age.sum()

292.0

In [89]:
del data["School"]

In [90]:
data

    Name   Age
0    Ali  12.0
1    NaN  34.0
2  Fatma  56.0
3    NaN   NaN
4   Veli  45.0
5   Veli  78.0
6    NaN  67.0

In [91]:
data.sort_values("Age",ascending=False)

    Name   Age
5   Veli  78.0
6    NaN  67.0
2  Fatma  56.0
4   Veli  45.0
1    NaN  34.0
0    Ali  12.0
3    NaN   NaN

In [92]:
data.sort_values("Age")

    Name   Age
0    Ali  12.0
1    NaN  34.0
4   Veli  45.0
2  Fatma  56.0
6    NaN  67.0
5   Veli  78.0
3    NaN   NaN

In [93]:
pd.isna(data["Name"])

0    False
1     True
2    False
3     True
4    False
5    False
6     True
Name: Name, dtype: bool

In [94]:
data.dropna(thresh=1)

    Name   Age
0    Ali  12.0
1    NaN  34.0
2  Fatma  56.0
4   Veli  45.0
5   Veli  78.0
6    NaN  67.0

In [99]:
data.to_csv("deneme.csv",header=True,index=None)